In [1]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.8.6-cp37-cp37m-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6
WARNING: You are using pip version 20.1.1; however, version 20.2.3 is available.
You should consider upgrading via the 'c:\users\zhenchen\appdata\local\programs\python\python37\python.exe -m pip install --upgrade pip' command.

In [4]:
%load_ext sql

In [ ]:
#%sql postgresql://postgres:saturnlab@localhost:5432/bdmi-test

In [5]:
%sql postgresql://gpadmin:gpdb2020@101.6.160.22:4132/testdb

'Connected: gpadmin@testdb'

# Create Movies Table

In [6]:
%%sql
DROP TABLE IF EXISTS Movies;
CREATE TABLE Movies(title VARCHAR(50), year INT, director VARCHAR(50), length INT);
INSERT INTO Movies VALUES('algorithm', 1967, 'Joe', 123);
INSERT INTO Movies VALUES('data structure'', 1992, 'Bob', 190);
INSERT INTO Movies VALUES('database', 1998, 'Jim', 176);

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%sql SELECT * FROM movies

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
3 rows affected.

[('The Databaser', 1992, 'John Bob', 190),
 ('Database Wars', 1967, 'John Joe', 123),
 ('Database Wars', 1998, 'John Jim', 176)]

In [8]:
%sql DROP TABLE IF EXISTS A; DROP TABLE IF EXISTS B;
%sql CREATE TABLE A (x int, y int); CREATE TABLE B (x int, y int);
for i in range(1,6):
    %sql INSERT INTO A VALUES (:i, :i+1)
for i in range(1,11,3):
    %sql INSERT INTO B VALUES (:i, :i+2)

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
Done.
Done.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
Done.
Done.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.
 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.

In [9]:
%sql SELECT * FROM movies

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
3 rows affected.

[('Database Wars', 1967, 'John Joe', 123),
 ('Database Wars', 1998, 'John Jim', 176),
 ('The Databaser', 1992, 'John Bob', 190)]

In [10]:
%%sql
SELECT m.title 
FROM Movies m
WHERE m.year <> ANY(SELECT year FROM Movies WHERE title = m.title);

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
2 rows affected.

[('Database Wars',), ('Database Wars',)]

In [11]:
%%sql
SELECT DISTINCT m1.title
FROM movies m1, movies m2
WHERE m1.title = m2.title AND m1.year <> m2.year;

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.

[('Database Wars',)]

# Create Product Table

In [12]:
%%sql drop table if exists product;
create table product(
       pname        varchar primary key, -- name of the product
       price        money,               -- price of the product
       category     varchar,             -- category
       manufacturer varchar NOT NULL     -- manufacturer
);
insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%sql select * from product;

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
4 rows affected.

[('Gizmo', '$19.99', 'Gadgets', 'GizmoWorks'),
 ('SingleTouch', '$149.99', 'Photography', 'Canon'),
 ('PowerGizmo', '$29.99', 'Gadgets', 'GizmoWorks'),
 ('MultiTouch', '$203.99', 'Household', 'Hitachi')]

In [18]:
%%sql
SELECT * from Product 
WHERE category='Gadgets' and price > 20.0::money;

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
1 rows affected.

[('PowerGizmo', '$29.99', 'Gadgets', 'GizmoWorks')]

In [19]:
%%sql 
SELECT Pname, Price, Manufacturer
FROM Product;

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
4 rows affected.

[('PowerGizmo', '$29.99', 'GizmoWorks'),
 ('MultiTouch', '$203.99', 'Hitachi'),
 ('Gizmo', '$19.99', 'GizmoWorks'),
 ('SingleTouch', '$149.99', 'Canon')]

In [20]:
%%sql
SELECT Pname, Price, Manufacturer
FROM Product
WHERE category='Gadgets';

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
2 rows affected.

[('Gizmo', '$19.99', 'GizmoWorks'), ('PowerGizmo', '$29.99', 'GizmoWorks')]

In [23]:
%%sql
SELECT * FROM Product;

SELECT
    p.manufacturer, p.pname, p.price
FROM 
    (SELECT distinct p0.Manufacturer
     FROM Product p0
     WHERE p0.price < 20.00::money) cp, -- this is a nested query!
    Product p
WHERE 
    p.manufacturer = cp.manufacturer and p.price >= 20.00::money

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
4 rows affected.
1 rows affected.

[('GizmoWorks', 'PowerGizmo', '$29.99')]

# Create Company Table

In [24]:
%%sql
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('GizmoWorks', 25.0, 'USA');
insert into company values ('Canon', 65.0, 'Japan');
insert into company values ('Hitachi', 15.0, 'Japan');

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [25]:
%sql select * from company;

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
3 rows affected.

[('Canon', '$65.00', 'Japan'),
 ('GizmoWorks', '$25.00', 'USA'),
 ('Hitachi', '$15.00', 'Japan')]

In [26]:
%%sql drop table if exists product;
create table product(
       pname varchar primary key, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       foreign key (manufacturer) references company(cname));

insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [27]:
try:
    %sql insert into product values('MultiTouch', 203.99, 'Household', 'Google');
except Exception as e:
    print(e) 
    print("Rejected!")

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "product_pkey"  (seg1 10.0.1.43:6000 pid=14703)
DETAIL:  Key (pname)=(MultiTouch) already exists.

[SQL: insert into product values('MultiTouch', 203.99, 'Household', 'Google');]
(Background on this error at: http://sqlalche.me/e/gkpj)
Rejected!

# Joins

In [28]:
%%sql
SELECT pname, price
FROM product, company
where manufacturer=cname and country='Japan';

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
2 rows affected.

[('SingleTouch', '$149.99'), ('MultiTouch', '$203.99')]

In [29]:
%%sql -- duplicate answer
SELECT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';

 * postgresql://gpadmin:***@101.6.160.22:4132/testdb
2 rows affected.

[('USA',), ('USA',)]

In [ ]:
%%sql -- duplicate answer
SELECT DISTINCT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';